---
kind: other
id: Methods.T:Autodesk.Revit.DB.FabricationPartType
source: html/fc622e4d-5827-ca49-24e1-80d863009da9.htm
---
# FabricationPartType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.